Robothaler/BeltWinder-Matter/lib/esp32_ble_simple/esp32_ble_simple.cpp
#include "esp32_ble_simple.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

extern "C" {
    #include "host/ble_hs.h"
    #include "host/ble_gap.h"
}

static const char *TAG = "BLESimple";

namespace esp32_ble_simple {

SimpleBLEScanner *SimpleBLEScanner::instance_ = nullptr;

// ═══════════════════════════════════════════════════════════════════════
// Constructor / Destructor
// ═══════════════════════════════════════════════════════════════════════

SimpleBLEScanner::SimpleBLEScanner()
    : scanning_(false),
      scan_active_(true),
      scan_continuous_(false),
      scan_duration_(30),
      scan_interval_(300),
      scan_window_(100),
      scan_start_time_(0),
      listener_(nullptr),
      cache_timeout_ms_(5000),
      whitelist_active_(false) {
    instance_ = this;
}


SimpleBLEScanner::~SimpleBLEScanner() {
    stop_scan();
    device_cache_.clear();
    instance_ = nullptr;
}

// ═══════════════════════════════════════════════════════════════════════
// Setup
// ═══════════════════════════════════════════════════════════════════════

bool SimpleBLEScanner::setup() {
    ESP_LOGI(TAG, "Setting up Simple BLE Scanner...");
    
    // ✅ NO NimBLE INIT HERE!
    // Matter hat es bereits initialisiert!
    
    ESP_LOGI(TAG, "→ Verifying NimBLE Host...");
    
    if (!ble_hs_is_enabled()) {
        ESP_LOGE(TAG, "✗ NimBLE Host not enabled!");
        ESP_LOGE(TAG, "  Matter should have initialized it");
        return false;
    }
    
    ESP_LOGI(TAG, "✓ NimBLE Host is enabled by Matter");
    ESP_LOGI(TAG, "✓ Simple BLE Scanner setup complete");
    
    return true;
}

// ═══════════════════════════════════════════════════════════════════════
// Loop
// ═══════════════════════════════════════════════════════════════════════

void SimpleBLEScanner::loop() {
    if (!scanning_) return;
    
    if (!scan_continuous_ && scan_duration_ > 0) {
        uint32_t elapsed = (xTaskGetTickCount() * portTICK_PERIOD_MS) - scan_start_time_;
        
        if (elapsed >= (scan_duration_ * 1000)) {
            ESP_LOGI(TAG, "Scan duration elapsed, stopping scan");
            stop_scan();
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════
// Scanning Control
// ═══════════════════════════════════════════════════════════════════════

bool SimpleBLEScanner::start_scan(uint32_t duration_sec) {
    if (scanning_) {
        ESP_LOGW(TAG, "Scan already in progress");
        return false;
    }
    
    // ══════════════════════════════════════════════════════════════════
    // ✅ NEW: Check if NimBLE is ready (Matter might have initialized it)
    // ══════════════════════════════════════════════════════════════════
    
    ESP_LOGI(TAG, "→ Checking NimBLE Host status...");
    
    if (!ble_hs_is_enabled()) {
        ESP_LOGE(TAG, "✗ NimBLE Host is NOT enabled!");
        ESP_LOGE(TAG, "  This should not happen - Matter should have started it");
        return false;
    }
    
    ESP_LOGI(TAG, "✓ NimBLE Host is enabled");
    
    // Wait for Host-Controller sync (Matter might still be syncing)
    if (ble_hs_synced() == 0) {
        ESP_LOGI(TAG, "→ Waiting for Host-Controller sync...");
        
        for (int i = 0; i < 100; i++) {  // Max 10 Sekunden
            vTaskDelay(pdMS_TO_TICKS(100));
            if (ble_hs_synced()) {
                ESP_LOGI(TAG, "✓ Synced after %d ms", i * 100);
                break;
            }
        }
        
        if (ble_hs_synced() == 0) {
            ESP_LOGE(TAG, "✗ Sync timeout after 10 seconds!");
            return false;
        }
    } else {
        ESP_LOGI(TAG, "✓ Host-Controller already synced");
    }
    
    ESP_LOGI(TAG, "");
    
    // ══════════════════════════════════════════════════════════════════
    // Rest of start_scan() bleibt UNVERÄNDERT!
    // ══════════════════════════════════════════════════════════════════
    
    scan_duration_ = duration_sec;
    scan_start_time_ = xTaskGetTickCount() * portTICK_PERIOD_MS;
    
    ESP_LOGI(TAG, "═══════════════════════════════════");
    ESP_LOGI(TAG, "Starting BLE scan");
    ESP_LOGI(TAG, "═══════════════════════════════════");
    ESP_LOGI(TAG, "Duration: %u seconds", duration_sec);
    ESP_LOGI(TAG, "Mode: %s", scan_active_ ? "ACTIVE" : "PASSIVE");
    ESP_LOGI(TAG, "Interval: %u ms", scan_interval_);
    ESP_LOGI(TAG, "Window: %u ms", scan_window_);
    ESP_LOGI(TAG, "Continuous: %s", scan_continuous_ ? "YES" : "NO");
    
    // Whitelist Status
    if (whitelist_active_) {
        ESP_LOGI(TAG, "Whitelist: ACTIVE (%d device(s))", whitelist_addrs_.size());
        for (size_t i = 0; i < whitelist_addrs_.size(); i++) {
            const auto& addr = whitelist_addrs_[i];
            ESP_LOGI(TAG, "  [%d] %02X:%02X:%02X:%02X:%02X:%02X",
                     i + 1,
                     addr.val[5], addr.val[4], addr.val[3],
                     addr.val[2], addr.val[1], addr.val[0]);
        }
    } else {
        ESP_LOGI(TAG, "Whitelist: DISABLED (scanning all devices)");
    }
    
    ESP_LOGI(TAG, "");
    
    struct ble_gap_disc_params disc_params = {};
    disc_params.filter_duplicates = 0;
    disc_params.passive = scan_active_ ? 0 : 1;
    disc_params.itvl = scan_interval_ * 1000 / 625;
    disc_params.window = scan_window_ * 1000 / 625;
    
    if (whitelist_active_) {
        disc_params.filter_policy = BLE_HCI_SCAN_FILT_USE_WL;  // Use Whitelist!
    } else {
        disc_params.filter_policy = BLE_HCI_SCAN_FILT_NO_WL;   // Scan all
    }
    
    disc_params.limited = 0;
    
    ESP_LOGI(TAG, "BLE GAP Parameters:");
    ESP_LOGI(TAG, "  passive: %d", disc_params.passive);
    ESP_LOGI(TAG, "  itvl: %d (BLE units)", disc_params.itvl);
    ESP_LOGI(TAG, "  window: %d (BLE units)", disc_params.window);
    ESP_LOGI(TAG, "  filter_duplicates: %d", disc_params.filter_duplicates);
    ESP_LOGI(TAG, "  filter_policy: %d (%s)",
             disc_params.filter_policy,
             whitelist_active_ ? "WHITELIST" : "NO FILTER");
    ESP_LOGI(TAG, "");
    
    int rc = ble_gap_disc(BLE_OWN_ADDR_PUBLIC, 
                         scan_continuous_ ? BLE_HS_FOREVER : (duration_sec * 1000),
                         &disc_params,
                         gap_event_handler_static,
                         nullptr);
    
