Robothaler/BeltWinder-Matter/lib/esp32_ble_simple/esp32_ble_simple.cpp
    if (rc == 0) {
        scanning_ = true;
        ESP_LOGI(TAG, "✓ ble_gap_disc() returned 0 (success)");
        ESP_LOGI(TAG, "✓ BLE scan started successfully");
        ESP_LOGI(TAG, "═══════════════════════════════════");
        return true;
    } else {
        ESP_LOGE(TAG, "✗ ble_gap_disc() failed with error: %d", rc);
        ESP_LOGE(TAG, "");
        
        // Error code meanings:
        switch (rc) {
            case BLE_HS_EALREADY:
                ESP_LOGE(TAG, "  Error: EALREADY - Scan already in progress");
                break;
            case BLE_HS_EINVAL:
                ESP_LOGE(TAG, "  Error: EINVAL - Invalid parameters");
                break;
            case BLE_HS_EBUSY:
                ESP_LOGE(TAG, "  Error: EBUSY - BLE stack busy");
                break;
            default:
                ESP_LOGE(TAG, "  Error: Unknown (%d)", rc);
                break;
        }
        
        ESP_LOGE(TAG, "═══════════════════════════════════");
        return false;
    }
}



void SimpleBLEScanner::stop_scan() {
    if (!scanning_) return;
    
    int rc = ble_gap_disc_cancel();
    
    if (rc == 0) {
        scanning_ = false;
        ESP_LOGI(TAG, "✓ BLE scan stopped");
    } else {
        ESP_LOGE(TAG, "✗ Failed to stop scan: %d", rc);
    }
}

// ═══════════════════════════════════════════════════════════════════════
// GAP Event Handler
// ═══════════════════════════════════════════════════════════════════════

int SimpleBLEScanner::gap_event_handler_static(
    struct ble_gap_event *event,
    void *arg) {
    
    if (instance_) {
        return instance_->gap_event_handler(event);
    }
    return 0;
}

int SimpleBLEScanner::gap_event_handler(struct ble_gap_event *event) {
    
    switch (event->type) {
        case BLE_GAP_EVENT_DISC: {
            
            uint8_t event_type = event->disc.event_type;
            
            // MAC Address
            char addr_str[18];
            snprintf(addr_str, sizeof(addr_str), 
                    "%02x:%02x:%02x:%02x:%02x:%02x",
                    event->disc.addr.val[5],
                    event->disc.addr.val[4],
                    event->disc.addr.val[3],
                    event->disc.addr.val[2],
                    event->disc.addr.val[1],
                    event->disc.addr.val[0]);
            
            uint64_t mac_uint64 = 0;
            for (int i = 0; i < 6; i++) {
                mac_uint64 |= ((uint64_t)event->disc.addr.val[i]) << (i * 8);
            }
            
            // Parse device
            SimpleBLEDevice device;
            device.parse_advertisement(&event->disc);
            
            uint8_t base_event_type = event_type & 0x0F;
            bool is_adv = (base_event_type == 0x00 || base_event_type == 0x03);
            bool is_scan_rsp = (base_event_type == 0x04);
            
            std::string name = device.get_name();
            
            // ════════════════════════════════════════════════════════════
            // ✅ SMART LOGGING: Nur interessante Devices detailliert loggen
            // ════════════════════════════════════════════════════════════
            
            bool is_interesting = false;
            
            // Check if Shelly BLU
            if (name.length() >= 4 && 
                (name.substr(0, 4) == "SBDW" || 
                 name.substr(0, 4) == "SBW-" ||
                 name.substr(0, 7) == "Shelly ")) {
                is_interesting = true;
            }
            
            // Check if has Service Data (might be relevant)
            if (!is_interesting && device.get_service_datas().size() > 0) {
                // Nur loggen wenn BTHome UUID
                for (const auto& sd : device.get_service_datas()) {
                    if (sd.uuid.is_16bit() && sd.uuid.get_uuid16() == 0xFCD2) {
                        is_interesting = true;
                        break;
                    }
                }
            }
            
            // ════════════════════════════════════════════════════════════
            // CONDITIONAL LOGGING
            // ════════════════════════════════════════════════════════════
            
            if (is_interesting) {
                // ✅ FULL LOGGING für interessante Devices
                ESP_LOGI(TAG, "╔═══════════════════════════════════╗");
                ESP_LOGI(TAG, "║  BLE DEVICE (INTERESTING)         ║");
                ESP_LOGI(TAG, "╚═══════════════════════════════════╝");
                ESP_LOGI(TAG, "Address: %s", addr_str);
                ESP_LOGI(TAG, "Event Type: 0x%02X (%s)", event_type, 
                         is_scan_rsp ? "SCAN_RSP" : "ADVERTISEMENT");
                ESP_LOGI(TAG, "RSSI: %d dBm", event->disc.rssi);
                ESP_LOGI(TAG, "Name: %s", name.empty() ? "(empty)" : name.c_str());
                ESP_LOGI(TAG, "Service Datas: %d", device.get_service_datas().size());
                ESP_LOGI(TAG, "");
            } else {
                // ✅ MINIMAL LOGGING für Noise
                ESP_LOGV(TAG, "BLE: %s | %s | RSSI %d | Name: %s",
                         addr_str,
                         is_scan_rsp ? "SCAN_RSP" : "ADV",
                         event->disc.rssi,
                         name.empty() ? "(none)" : name.c_str());
            }
            
            // ════════════════════════════════════════════════════════════
            // ✅ HOME ASSISTANT STYLE: Callback NUR bei ADV mit Service Data!
            // ════════════════════════════════════════════════════════════
            
            if (scan_active_) {
                auto it = device_cache_.find(mac_uint64);
                
                if (it == device_cache_.end()) {
                    // ════════════════════════════════════════════════════
                    // NEW DEVICE
                    // ════════════════════════════════════════════════════
                    
                    CachedDevice cached;
                    cached.device = device;
                    cached.last_seen = xTaskGetTickCount() * portTICK_PERIOD_MS;
                    cached.has_adv = is_adv;
                    cached.has_scan_rsp = is_scan_rsp;
                    
