Robothaler/BeltWinder-Matter/lib/esp32_ble_simple/esp32_ble_simple.cpp
                    device_cache_[mac_uint64] = cached;
                    
                    if (is_interesting) {
                        ESP_LOGI(TAG, "→ Cached new device");
                    }
                    
                    // ✅ CALLBACK NUR bei ADV mit Service Data!
                    if (is_adv && device.get_service_datas().size() > 0) {
                        if (is_interesting) {
                            ESP_LOGI(TAG, "→ ADV has Service Data - processing immediately");
                        }
                        
                        if (listener_) {
                            bool should_continue = listener_->on_device_found(device);
                            
                            if (!should_continue && !scan_continuous_) {
                                ESP_LOGI(TAG, "→ Stopping scan as requested");
                                stop_scan();
                            }
                        }
                    }
                    
                } else {
                    // ════════════════════════════════════════════════════
                    // DEVICE IN CACHE
                    // ════════════════════════════════════════════════════
                    
                    CachedDevice& cached = it->second;
                    
                    if (is_scan_rsp) {
                        // ✅ SCAN_RSP: Nur Name mergen, KEIN Callback!
                        
                        if (!name.empty() && cached.device.get_name().empty()) {
                            if (is_interesting) {
                                ESP_LOGI(TAG, "→ SCAN_RSP: Updating name: '%s'", name.c_str());
                            }
                            cached.device.set_name(name);
                        }
                        
                        cached.has_scan_rsp = true;
                        cached.last_seen = xTaskGetTickCount() * portTICK_PERIOD_MS;
                        
                        // ❌ KEIN CALLBACK bei SCAN_RSP!
                        
                    } else if (is_adv && device.get_service_datas().size() > 0) {
                        // ✅ ADV mit Service Data: SOFORT Callback!
                        
                        if (is_interesting) {
                            ESP_LOGI(TAG, "→ ADV with Service Data - processing immediately");
                        }
                        
                        // Name aus Cache übernehmen falls vorhanden
                        if (!cached.device.get_name().empty()) {
                            device.set_name(cached.device.get_name());
                        }
                        
                        // Cache aktualisieren
                        cached.device = device;  // ← ERSETZEN, nicht mergen!
                        cached.has_adv = true;
                        cached.last_seen = xTaskGetTickCount() * portTICK_PERIOD_MS;
                        
                        // ✅ CALLBACK AUSLÖSEN!
                        if (listener_) {
                            bool should_continue = listener_->on_device_found(device);
                            
                            if (!should_continue && !scan_continuous_) {
                                ESP_LOGI(TAG, "→ Stopping scan");
                                stop_scan();
                            }
                        }
                        
                    } else {
                        // ✅ ADV ohne Service Data: Nur Cache aktualisieren
                        
                        if (is_interesting) {
                            ESP_LOGV(TAG, "→ ADV without Service Data - updating cache only");
                        }
                        
                        cached.has_adv = is_adv;
                        cached.last_seen = xTaskGetTickCount() * portTICK_PERIOD_MS;
                        
                        // Update RSSI wenn stärker
                        if (device.get_rssi() > cached.device.get_rssi()) {
                            cached.device.set_rssi(device.get_rssi());
                        }
                    }
                }
                
                // Cleanup (nur alle 1000 Events)
                static uint32_t cleanup_counter = 0;
                if (++cleanup_counter % 1000 == 0) {
                    cleanup_device_cache();
                }
                
            } else {
                // ════════════════════════════════════════════════════════
                // PASSIVE SCAN
                // ════════════════════════════════════════════════════════
                
                if (listener_) {
                    bool should_continue = listener_->on_device_found(device);
                    
                    if (!should_continue && !scan_continuous_) {
                        stop_scan();
                    }
                }
            }
            
            break;
        }
        
        case BLE_GAP_EVENT_DISC_COMPLETE: {
            ESP_LOGI(TAG, "");
            ESP_LOGI(TAG, "╔═══════════════════════════════════╗");
            ESP_LOGI(TAG, "║  SCAN COMPLETE                    ║");
            ESP_LOGI(TAG, "╚═══════════════════════════════════╝");
            ESP_LOGI(TAG, "Reason: %d", event->disc_complete.reason);
            
            scanning_ = false;
            
            // Process remaining cache
            if (!device_cache_.empty()) {
                ESP_LOGW(TAG, "⚠ %d devices in cache (incomplete)", 
                         device_cache_.size());
                
                // ✅ OPTIONAL: Verarbeite auch incomplete devices
                if (listener_) {
                    for (auto& pair : device_cache_) {
                        // Nur wenn Service Data vorhanden
                        if (pair.second.device.get_service_datas().size() > 0) {
                            listener_->on_device_found(pair.second.device);
                        }
                    }
                }
                
                device_cache_.clear();
            }
            
            if (scan_continuous_) {
                ESP_LOGI(TAG, "→ Continuous: Restarting...");
                vTaskDelay(pdMS_TO_TICKS(100));
                start_scan(scan_duration_);
            }
            
