Robothaler/BeltWinder-Matter/lib/esp32_ble_simple/esp32_ble_simple.cpp
            ESP_LOGI(TAG, "");
            break;
        }
        
        default:
            ESP_LOGV(TAG, "GAP event: %d", event->type);
            break;
    }
    
    return 0;
}



// ════════════════════════════════════════════════════════════════════════
// Helper: Merge Device Data
// ════════════════════════════════════════════════════════════════════════

void SimpleBLEScanner::merge_device_data(
    SimpleBLEDevice& target, 
    const SimpleBLEDevice& source) {
    
    // ════════════════════════════════════════════════════════════════════
    // 1. Merge Name (prefer non-empty)
    // ════════════════════════════════════════════════════════════════════
    
    if (target.get_name().empty() && !source.get_name().empty()) {
        ESP_LOGI(TAG, "  → Merging name: '%s'", source.get_name().c_str());
        target.set_name(source.get_name());
    }
    
    // ════════════════════════════════════════════════════════════════════
    // 2. Service Data: DO NOT MERGE!
    // ════════════════════════════════════════════════════════════════════
    
    // ✅ CRITICAL DESIGN DECISION:
    //    BTHome (and similar protocols) send the CURRENT state in EVERY advertisement.
    //    We should NOT cache/merge Service Data because:
    //    
    //    1. Each ADV contains the LATEST state (e.g., Window OPEN/CLOSED)
    //    2. Merging would accumulate old + new data → Parser confusion
    //    3. The callback on_device_found() is called for EACH event
    //    4. The device object in the callback contains THIS event's data
    //    
    //    Therefore: Skip Service Data merging entirely!
    //    The current Service Data in 'target' represents the LATEST event.
    
    const auto& source_sd = source.get_service_datas();
    if (!source_sd.empty()) {
        ESP_LOGV(TAG, "  → Service Data present in source (%d items)", source_sd.size());
        ESP_LOGV(TAG, "     Strategy: NOT merging (use current event data only)");
        
        // ✅ NO MERGE - Service Data already in target from current event!
    }
    
    // ════════════════════════════════════════════════════════════════════
    // 3. Update RSSI (prefer stronger signal)
    // ════════════════════════════════════════════════════════════════════
    
    if (source.get_rssi() > target.get_rssi()) {
        ESP_LOGI(TAG, "  → Updating RSSI: %d → %d dBm",
                 target.get_rssi(), source.get_rssi());
        target.set_rssi(source.get_rssi());
    }
}



// ════════════════════════════════════════════════════════════════════════
// Helper: Cleanup Device Cache
// ════════════════════════════════════════════════════════════════════════

void SimpleBLEScanner::cleanup_device_cache()
{
    uint32_t now = xTaskGetTickCount() * portTICK_PERIOD_MS;

    for (auto it = device_cache_.begin(); it != device_cache_.end();)
    {
        if (now - it->second.last_seen > cache_timeout_ms_)
        {
            ESP_LOGW(TAG, "  → Cache timeout for device - processing anyway");

            // Process incomplete device
            if (listener_)
            {
                listener_->on_device_found(it->second.device);
            }

            it = device_cache_.erase(it);
        }
        else
        {
            ++it;
        }
    }
}

// ════════════════════════════════════════════════════════════════════════
// ✅ WHITELIST MANAGEMENT
// ════════════════════════════════════════════════════════════════════════

bool SimpleBLEScanner::set_scan_whitelist(const std::vector<WhitelistEntry>& entries) {
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "╔═══════════════════════════════════╗");
    ESP_LOGI(TAG, "║  CONFIGURE SCAN WHITELIST         ║");
    ESP_LOGI(TAG, "╚═══════════════════════════════════╝");
    ESP_LOGI(TAG, "");
    
    if (scanning_) {
        ESP_LOGE(TAG, "✗ Cannot configure whitelist while scanning!");
        ESP_LOGE(TAG, "  Stop scan first");
        return false;
    }
    
    whitelist_addrs_.clear();
    
    if (entries.empty()) {
        ESP_LOGI(TAG, "→ Empty whitelist - disabling filter");
        whitelist_active_ = false;
        return true;
    }
    
    ESP_LOGI(TAG, "Adding %d address(es) to whitelist:", entries.size());
    
    for (const auto& entry : entries) {
        ble_addr_t addr;
        
        // ════════════════════════════════════════════════════════════════
        // Parse MAC address string
        // ════════════════════════════════════════════════════════════════
        
        const std::string& mac_str = entry.mac_address;
        
        if (mac_str.length() != 17) {
            ESP_LOGE(TAG, "✗ Invalid MAC format: %s", mac_str.c_str());
            continue;
        }
        
        bool parse_ok = true;
        for (int i = 0; i < 6; i++) {
            char hex[3] = {mac_str[i*3], mac_str[i*3+1], 0};
            char* endptr;
            long val = strtol(hex, &endptr, 16);
            
            if (*endptr != 0 || val < 0 || val > 255) {
                parse_ok = false;
                break;
            }
            
            // ✅ NimBLE erwartet Little-Endian (umgekehrte Reihenfolge)
            addr.val[5 - i] = (uint8_t)val;
        }
        
        if (!parse_ok) {
            ESP_LOGE(TAG, "✗ Failed to parse: %s", mac_str.c_str());
            continue;
        }
        
        // ════════════════════════════════════════════════════════════════
        // ✅ VERWENDE GESPEICHERTEN ADDRESS TYPE!
        // ════════════════════════════════════════════════════════════════
        
        addr.type = entry.address_type;
        
        whitelist_addrs_.push_back(addr);
        
        const char* type_str;
        switch (entry.address_type) {
            case BLE_ADDR_PUBLIC:  type_str = "PUBLIC"; break;
            case BLE_ADDR_RANDOM:  type_str = "RANDOM"; break;
            case BLE_ADDR_PUBLIC_ID: type_str = "PUBLIC_ID"; break;
            case BLE_ADDR_RANDOM_ID: type_str = "RANDOM_ID"; break;
            default: type_str = "UNKNOWN";
        }
        
        ESP_LOGI(TAG, "  ✓ %s (type: %s [%d])", 
                 mac_str.c_str(), type_str, entry.address_type);
    }
    
    if (whitelist_addrs_.empty()) {
        ESP_LOGE(TAG, "");
        ESP_LOGE(TAG, "✗ No valid addresses in whitelist!");
        whitelist_active_ = false;
        return false;
    }
    
    // ════════════════════════════════════════════════════════════════════
    // Apply whitelist to NimBLE
    // ════════════════════════════════════════════════════════════════════
    
