Robothaler/BeltWinder-Matter/lib/esp32_ble_simple/esp32_ble_simple.cpp
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "→ Applying whitelist to NimBLE controller...");
    
    // Clear existing whitelist
    int rc = ble_gap_wl_set(nullptr, 0);
    if (rc != 0) {
        ESP_LOGE(TAG, "✗ Failed to clear whitelist: %d", rc);
        return false;
    }
    
    // Add addresses to whitelist
    rc = ble_gap_wl_set(whitelist_addrs_.data(), whitelist_addrs_.size());
    if (rc != 0) {
        ESP_LOGE(TAG, "✗ Failed to set whitelist: %d", rc);
        ESP_LOGE(TAG, "  Error code: %d", rc);
        
        // ✅ ERROR DETAIL LOGGING
        switch (rc) {
            case BLE_HS_EINVAL:
                ESP_LOGE(TAG, "  Reason: Invalid parameters");
                break;
            case BLE_HS_ENOMEM:
                ESP_LOGE(TAG, "  Reason: Out of memory");
                break;
            case BLE_HS_EBUSY:
                ESP_LOGE(TAG, "  Reason: BLE stack busy");
                break;
            default:
                ESP_LOGE(TAG, "  Reason: Unknown (%d)", rc);
        }
        
        return false;
    }
    
    whitelist_active_ = true;
    
    ESP_LOGI(TAG, "✓ Whitelist configured successfully");
    ESP_LOGI(TAG, "  %d address(es) active", whitelist_addrs_.size());
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "⚠ Next scan will ONLY see whitelisted devices!");
    ESP_LOGI(TAG, "");
    
    return true;
}


bool SimpleBLEScanner::clear_scan_whitelist() {
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "╔═══════════════════════════════════╗");
    ESP_LOGI(TAG, "║  CLEAR SCAN WHITELIST             ║");
    ESP_LOGI(TAG, "╚═══════════════════════════════════╝");
    ESP_LOGI(TAG, "");
    
    if (scanning_) {
        ESP_LOGE(TAG, "✗ Cannot clear whitelist while scanning!");
        return false;
    }
    
    whitelist_addrs_.clear();
    whitelist_active_ = false;
    
    // Clear NimBLE whitelist
    int rc = ble_gap_wl_set(nullptr, 0);
    if (rc != 0) {
        ESP_LOGE(TAG, "✗ Failed to clear NimBLE whitelist: %d", rc);
        return false;
    }
    
    ESP_LOGI(TAG, "✓ Whitelist cleared");
    ESP_LOGI(TAG, "  Next scan will see ALL devices");
    ESP_LOGI(TAG, "");
    
    return true;
}

}  // namespace esp32_ble_simple
